// Задание 1
// Выведете в консоль 2 раза слово «Привет».

// for(say=1;say<=2;say++) {
//     console.log('Привет')
// }

// Задание 2
// Выведете в консоль цифры от 1 до 5.

// for(num=1;num<6;num++) {
//     console.log(num)
// }

// Задание 3
// Выведите в консоль числа от 7 до 22.

// for(num=7;num<23;num++) {
//      console.log(num)
// }

// Задание 4

// const obj = {
//     'Коля': '200',
//     'Вася': '300',
//     'Петя': '400',
// };

// for (let worker in obj) {
//     console.log(`${worker} — зарплата ${obj[worker]} долларов`);
// }

// Задание 5

// let n = 1000
// let num = 1
// do {
//     n = n / 2;
//     num = ++num;
// } while (n > 50);

// console.log(`Получилось число ${n} при количестве итераций ${--num}`);

// Задание 6

// for (let day = 5; day <= 31; day = day + 7) {
//     console.log(`Сегодня пятница ${day}-ое число.Необходимо подготовить отчет.`)
// }
